{"class_name": "Model", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_3", "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 24], "sparse": false}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_8", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_8", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_9", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_9", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_28", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_28", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 2, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["dense_9", 0, 0, {}]]]}], "name": "model_26", "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_28", 0, 0]]}}