{"class_name": "Model", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 75], "sparse": false}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_1", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 128, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 64, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_6", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_6", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 2, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "name": "model_2", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_6", 0, 0]]}}