{"class_name": "Model", "keras_version": "2.1.6-tf", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_5", "config": {"name": "input_5", "dtype": "float32", "batch_input_shape": [null, 16, 16, 16, 1], "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv3D", "name": "conv3d_1", "config": {"filters": 1, "name": "conv3d_1", "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "trainable": false, "use_bias": true, "kernel_size": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["input_5", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_2", "config": {"filters": 64, "name": "conv3d_2", "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "strides": [2, 2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "trainable": false, "use_bias": true, "kernel_size": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv3d_1", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_3", "config": {"filters": 64, "name": "conv3d_3", "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "trainable": false, "use_bias": true, "kernel_size": [3, 3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["conv3d_2", 0, 0, {}]]]}, {"class_name": "Conv3D", "name": "conv3d_4", "config": {"filters": 64, "name": "conv3d_4", "bias_regularizer": null, "padding": "same", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1, 1], "trainable": false, "use_bias": true, "kernel_size": [3, 3, 3], "data_format": "channels_last"}, "inbound_nodes": [[["conv3d_3", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "input_3", "config": {"name": "input_3", "dtype": "float32", "batch_input_shape": [null, 24], "sparse": false}, "inbound_nodes": []}, {"class_name": "Flatten", "name": "flatten_1", "config": {"name": "flatten_1", "trainable": false, "data_format": "channels_last"}, "inbound_nodes": [[["conv3d_4", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 75], "sparse": false}, "inbound_nodes": []}, {"class_name": "Dense", "name": "dense_8", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_8", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_15", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_15", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 128, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_9", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_9", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["dense_8", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_16", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_16", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 32, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 64, "trainable": false, "kernel_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_5", "config": {"axis": -1, "name": "concatenate_5", "trainable": true}, "inbound_nodes": [[["dense_9", 0, 0, {}], ["dense_16", 0, 0, {}], ["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_41", "config": {"use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "dense_41", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "kernel_regularizer": null, "units": 2, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["concatenate_5", 0, 0, {}]]]}], "name": "model_39", "input_layers": [["input_3", 0, 0], ["input_5", 0, 0], ["input_1", 0, 0]], "output_layers": [["dense_41", 0, 0]]}}